st = input('Введите строку: ')
# a = 0 # третий символ строки
# b = 0  # Предпоследний символ строки
# c = 0 # Первые пять символов
# d = 0 # Вся строка кроме последних двух символов
# e = 0 # все символы с четными индексами
# f = 0 # все символы с нечетными индексами
# g = 0 # обратный порядок
# h = 0 #  через один в обратном порядке
# i = 0 # длина данной строки
print(st)
print(st[2])
print(st[len(st) -2])
print(st[:5])
print(st[0: -2])
print(st[0:-1: 2])
print(st[1:: 2])
print(st[:: -1])
print(st[:: -2])
print(len(st))